[{
    "review": "Alcohol added style of ginjo. Lightly fruity and quite smooth. Affordable option for the Ginjo grade."
  },
  {
    "review": "Very soft, lots of fruit overtones. First glass was great, became a little much. Served with omakase sushi."
  },
  {
    "review": "I dream about this sake. It's great!"
  },
  {
    "review": "A fine Sake, but a bit underwhelming. Mellow, clean flavor, slightly fruity and sweet. A bit of alcohol on the finish. To me it missing something, just doesn't quite have that pop."
  },
  {
    "review": "It has a full-bodied, rich, robust taste. Rice, filberts, raisins on the nose. Earthy and macho. This fine brew remains one of my favorites. Great with food. "
  },
  {
    "review": "serve warm! A wonderful sake to pair with red meat, too."
  },
  {
    "review": "Heavy-duty! Good with spicy, flavorful foods, or drinking alone. Drank at cool room temperature with chashu pork and asparagus dressed wth rice vinegar and South River pepper garlic miso... Mmmmm, YES!"
  },
  {
    "review": "Dry, with a sweetish afternote. a bit bitter."
  },
  {
    "review": "It was deep and rich, with a strong masculine flavor."
  },
  {
    "review": "Great glass after glass. Strong aroma and flavor. Kampai, my friends. "
  },
  {
    "review": "Rich bold sake. Oldest branded sake in Japan"
  },
  {
    "review": "The brewery has quite a story which is briefly reviewed just under the lid. "
  },
  {
    "review": "Nonetheless, drinking this felt good sort of like leaving some quarters in the local charity collection box."
  },
  {
    "review": "Tons of bran, steamed rice, and almond flavor. Might benefit from warming."
  },
  {
    "review": "Incredibly complex and bright with lower acidity than most all sake.Dances on the tongue. Exceptional."
  },
  {
    "review": "Light, fruit scent on the nose. Clean, crisp taste. This would go great with sushi. Beautiful bottle. It would make an excellent gift. Overall very good."
  },
  {
    "review": "Delicious and elegant sake. Rounded and amazing example of sake"
  }
]
